-- 装备数据
EquipmentData = {
    ItemsType = {
        "主手武器1", "副手武器2", "头部装备3", "胸部装备4",
        "腰部装备5", "腿部装备6", "手部装备7", "脚部装备8",
        "项链9", "戒指10", "披风11"
    },
    -- 主手武器1
    -- 单手
    MainHandWeapon = {
        -- 剑
        Sword = {
            "之剑", "长剑", "短剑", "重剑", "之刃", "链刃",
            "刀锋", "弯刀"
        },
        -- 匕首
        Dagger = {
            "之牙", "之爪", "匕首", "之刺", "剃刀", "棘刺", "飞镖"
        },
        -- 斧子
        Axe = {"之斧", "战斧", "伐木斧", "石斧", "之咬", "铁斧"},
        -- 锤
        Hammer = {"之锤", "战锤", "石锤", "铁锤", "木锤"},
        -- 弓箭
        Arrow = {
            "之弓", "战弓", "橡木弓", "铁弓", "十字弩", "十字弓",
            "反曲弓", "长弓", "袖珍弩"
        },
        -- 法杖
        Staff = {"法杖", "短棍", "魔杖", "短杖", "小树枝"}
    },
    -- 副手武器2
    OffHandWeapon = { -- 副手装备
        -- 剑
        Sword = {
            "之剑", "长剑", "短剑", "重剑", "之刃", "链刃",
            "刀锋", "弯刀"
        },
        -- 盾 壁垒 契约 墙盾 护盾 塔盾 圆盾 防御者 符文盾
        Shield = {
            "之盾", "壁垒", "墙盾", "之墙", "护盾", "塔盾",
            "圆盾", "防御者", "符文盾", "盾牌", "纹章盾",
            "守护者", "之背", "卫士", "板盾"
        },
        -- 骨头
        Bone = {
            "头骨", "指骨", "遗骸", "复仇之眼", "头骨串", "之颅",
            "血祭"
        },
        -- 匕首
        Dagger = {
            "之牙", "之爪", "匕首", "之刺", "剃刀", "棘刺", "飞镖"
        },
        -- 书籍
        Book = {
            "赞美诗", "法典", "日记", "卷轴", "的秘密", "秘典"
        },
        -- 珠宝
        -- 箭袋 弹药袋 箭匣
        Quiver = {"箭袋", "弹药袋", "箭匣"},
        -- 法杖
        Staff = {"法杖", "短棍", "魔杖", "短杖", "小树枝"}
    },
    -- 头部装备3
    HeadEquipment = {
        "头盔", "皮盔", "之冠", "战盔", "遮阳帽", "之环", "坚盔",
        "之盔", "护盔", "之笼", "战冠", "头巾", "头冠", "宝冠",
        "头饰", "帽子", "罩帽", "头饰", "护目镜", "面罩", "兜帽",
        "宝冠", "软帽", "王冠", "面甲"
    },
    -- 胸部装备4
    ChestEquipment = {
        "胸甲", "护胸", "外套", "护甲", "板甲", "拥抱", "胸凯",
        "甲胄", "外衣", "长袍", "法袍", "之袍", "衣饰",
        "鬼纹长袍", "丝绸长袍", "罩衫", "法衣"
    },
    -- 腰部装备5
    WaistEquipment = {"腰带", "套索", "束带", "护腰"},
    -- 腿部装备6
    LegEquipment = {
        "短裤", "护腿", "长裤", "褶皱裙", "腿甲", "皮裤", "裹腿",
        "马裤", "护胫", "热裤", "腿凯", "胫凯", "胫甲"
    },
    -- 手部装备7
    HandEquipment = {
        "手套", "护手", "裹手", "鬼纹手套", "拳套", "之手",
        "丝质手套", "之爪", "之拳", "羊皮手套", "环带手套",
        "冷钢手套"
    },
    -- 脚部装备8
    FootEquipment = {
        "长靴", "战靴", "裹足", "便鞋", "之靴", "鬼纹长靴",
        "软鞋", "皮靴", "护足", "胫甲", "重靴", "护胫", "马靴",
        "足甲"
    },
    -- 项链9
    Necklace = {
        "坠饰", "项圈", "项链", "符咒", "颈饰", "护符", "珠宝",
        "烙印", "勋章", "之链", "魔晶珠串", "徽章", "之腾",
        "之石", "之眼", "之力", "徽记", "之心", "印记", "之牙",
        "之星", "之泪"
    },
    -- 戒指10
    Ring = {
        "戒指", "指环", "之戒", "徽记", "黄金戒指", "白银戒指",
        "月光石戒指", "红宝石戒指", "蓝宝石戒指",
        "黄宝石戒指"
    },
    -- 披风11
    Cloak = {"披风", "毛皮", "斗篷", "之幕", "裹衣"}
}
