

UnitDota = {
    --单位基础属性
    ["生命值"] ={
        Name =  "生命值",
        Explain = "单位的生命值，由基础生命值与额外生命值提供。",
        value = 0
    },
    ["生命回复速度"] ={
        Name =  "生命回复速度",
        Explain = "单位每1秒自动回复的生命值，由基础生命回复速度与额外生命回复速度提供。",
        value = 0
    },
    ["魔法值"] ={
        Name =  "魔法值",
        Explain = "单位的魔法值，由基础魔法值与额外魔法值提供。",
        value = 0
    },
    ["魔法回复速度"] ={
        Name =  "魔法回复速度",
        Explain = "单位每1秒自动回复的魔法值，由基础魔法回复速度与额外魔法回复速度提供。",
        value = 0
    },
    ["护甲"] ={
        Name =  "护甲",
        Explain = "单位的护甲。",
        value = 0
    },
    ["魔法抗性"] ={
        Name =  "魔法抗性",
        Explain = "单位的魔法抗性。",
        value = 0
    },
    ["攻击力"] ={
        Name =  "攻击力",
        Explain = "单位的攻击力，由基础攻击力、主属性和附加攻击力提供。每点主属性提供1点攻击力。",
        value = 0
    },
    ["法术强度"] ={
        Name =  "法术强度",
        Explain = "单位的法术强度。",
        value = 0
    },
    ["移动速度"] ={
        Name =  "移动速度",
        Explain = "单位每1秒能够移动的距离，由基础移动速度和附加移动速度提供。",
        value = 0
    },
    ["攻击速度"] ={
        Name =  "攻击速度",
        Explain = "单位攻击速度。",
        value = 0
    },
    ["闪避"] ={
        Name =  "闪避",
        Explain = "单位闪避。",
        value = 0
    },
   -- 英雄属性
    ["力量"] ={
        Name =  "力量",
        Explain = "单位在造成法术伤害时回复生命的比例。",
        value = 0
    },
    ["敏捷"] ={
        Name =  "敏捷",
        Explain = "单位在造成法术伤害时回复生命的比例。",
        value = 0
    },
    ["智力"] ={
        Name =  "智力",
        Explain = "单位在造成法术伤害时回复生命的比例。",
        value = 0
    },
    ["幸运"] ={
        Name =  "幸运",
        Explain = "单位在幸运。",
        value = 0
    },
    --特殊属性
    ["法术吸血"] ={
        Name =  "法术吸血",
        Explain = "单位在造成法术伤害时回复生命的比例。",
        value = 0
    },
    ["物理吸血"] ={
        Name =  "物理吸血",
        Explain = "单位在造成物理伤害时回复生命的比例.",
        value = 0
    },
    ["法术暴击强度"] ={
        Name =  "法术暴击强度",
        Explain = "单位在造成法术伤害或释放治疗技能时造成多倍伤害/治疗的倍数。",
        value = 0
    },
    ["法术暴击几率"] ={
        Name =  "法术暴击几率",
        Explain = "单位在造成法术伤害或释放治疗技能时造成多倍伤害/治疗的几率。",
        value = 0
    },
    ["物理暴击强度"] ={
        Name =  "物理暴击强度",
        Explain = "单位在造成物理伤害时造成多倍伤害的倍数。",
        value = 0
    },
    ["物理暴击几率"] ={
        Name =  "物理暴击几率",
        Explain = "单位在造成物理伤害时造成多倍伤害的几率。",
        value = 0
    },
    ["物理伤害减免"] ={
        Name =  "物理伤害减免",
        Explain = "单位在受到物理伤害时减少受到伤害的百分比。",
        value = 0
    },
    ["法术伤害减免"] ={
        Name =  "法术伤害减免",
        Explain = "单位在受到法术伤害时减少受到伤害的百分比。",
        value = 0
    },
    ["伤害减免"] ={
        Name =  "伤害减免",
        Explain = "单位在受到伤害时减少受到伤害的百分比。",
        value = 0
    }
    --
    --其他设定属性
    --精神 :  精神越高，你的法力值就越高，一定时间能放更多的技能 
    --火焰抗性
    --水系抗性
    --自然抗性
    --暗影抗性
    --邪能抗性
    --神圣抗性
}

-- 面向对象

function UnitDota:new(o)  
    o = o or {}  
    setmetatable(o,self)  
	self.__index = self 
	----
    
	-----
    return o  
end 
UnitDota.__index=UnitDota
return UnitDota 